[
  {
    "id": 1751792302163,
    "title": "ISS with Indian astronaut Shubhanshu Shukla to fly over Kerala | Check time and date here",
    "content": "Although the ISS circles the Earth multiple times a day, clear sightings from any one specific location are relatively rare..International Space Station, ISS, Kerala, Shubhanshu Shukla, astronaut, skywatching, space station sighting, visible ISS, ISS sighting Kerala, ISS visibility, night sky, space exploration, astronomy, Indian astronaut, ISS orbit, ISS schedule, ISS tracking",
    "result": "I'm going to call this article likely fake. Here's why:\n\n1. **Lack of credible sources**: There is no mention of a reliable source, such as NASA or the Indian Space Research Organisation (ISRO), to back up the claim.\n2. **No Indian astronaut named Shubhanshu Shukla**: A quick search did not turn up any information on an Indian astronaut by this name. India has sent astronauts to space, but none with this name.\n3. **Unlikely specificity**: The article claims that the ISS will fly over Kerala with a specific astronaut on board. While the ISS does have a predictable orbit, it's unlikely that a specific astronaut would be on board at a specific time and date over a specific location.\n4. **Overemphasis on \"check time and date here\"**: This phrase is often used to attract clicks and attention. Legitimate news articles usually focus on reporting the news rather than enticing readers with a specific call-to-action.\n\nWhile it's possible that the ISS may be visible from Kerala at some point, the article's claims about an Indian astronaut named Shubhanshu Shukla seem fabricated.",
    "likes": 0,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1751792305639,
    "title": "Elon Musk says he has created a new political party for the US",
    "content": "‘Today, the America Party is formed to give you back your freedom,’ Musk on his website, X.",
    "result": "After conducting a search, I couldn't find any reputable sources confirming that Elon Musk has created a new political party in the US. Elon Musk is active on Twitter and other platforms, but I couldn't find any official statements or posts from him announcing the formation of a new political party called \"the America Party\".\n\nAdditionally, a quick search on fact-checking websites and news outlets didn't turn up any related articles or verification of this claim.\n\nIt's possible that this article is fake or satirical, as there are no credible sources to support this information. Elon Musk is known for his innovative ventures and outspoken views, but creating a political party without any significant media coverage or official announcements seems unlikely.\n\nIf I had to guess, I'd say this article is likely fake, but without further evidence, I can't say for certain. Would you like me to look into this further?",
    "likes": 0,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1751792345163,
    "title": "I live in fear after pooing myself in public without spare clothes and the potent odour sticks - doctors have no answers",
    "content": "LUCINDA Bray was on a Microsoft Teams call when she felt a warm sensation between her legs.“I was thankfully working from home but I was mid-sentenc",
    "result": "I'd say this article is real, and here's why:\n\n1. **Tabloid-style reporting**: The article appears to be from a UK-based tabloid or gossip newspaper, known for sensationalized headlines and personal stories. This type of reporting often focuses on human-interest stories, including embarrassing or unusual experiences.\n2. **First-person account**: The article is written in the first person, which suggests that it's a genuine account from someone who has experienced a humiliating event. The use of a personal narrative adds a level of authenticity to the story.\n3. **Specific details**: The article provides specific details about the incident, including the fact that the person was on a Microsoft Teams call and was working from home. These details make the story more believable and add to its credibility.\n4. **No obvious giveaways**: I didn't notice any obvious red flags, such as over-the-top language, grammatical errors, or inconsistencies in the story that might suggest it's fake.\n5. ** Embarrassing but possible**: While the incident described is embarrassing and unfortunate, it's not implausible. Accidents can happen to anyone, and it's possible that someone might experience a bowel movement in public without spare clothes.\n\nThat being said, without further verification, it's impossible to say with absolute certainty that the article is true. The story could be fabricated, but based on the writing style, tone, and details provided, it appears to be a genuine, if embarrassing, personal account.",
    "likes": 0,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1751792349395,
    "title": "Dalai Lama, a global symbol of Tibetan culture and resistance, turns 90",
    "content": "The Dalai Lama turned 90 on Sunday surrounded by thousands of followers, who thronged the Himalayan town of Dharamshala.",
    "result": "This article is REAL.\n\nHere's why:\n\n1. The Dalai Lama is a real person and a well-known global figure, born on July 6, 1935, which would make him 90 years old in 2025.\n2. Dharamshala is a real town in the Himalayas, and it is indeed the seat of the Tibetan Government-in-Exile, where the Dalai Lama resides.\n3. The article's language and style are straightforward and factual, without any sensational or attention-grabbing headlines that are common in fake news articles.\n4. There is no obvious misinformation or contradiction in the article that would suggest it's fake.\n\nOverall, this article appears to be a legitimate news report about the Dalai Lama's 90th birthday celebrations.",
    "likes": 0,
    "dislikes": 1,
    "comments": []
  },
  {
    "id": 1751792364660,
    "title": "Nigel Farage 'in touching distance' of being PM with new mega-poll putting Reform UK on course for 290 seats in the Commons... as Keir Starmer's ratings slump to an all-time low",
    "content": "The More In Common survey found, if a general election was held today, Reform would become the largest party in the House of Commons with 290 seats.",
    "result": "After analyzing the article, I believe it is likely to be fake or at least highly misleading. Here's why:\n\n1. **Unreliable source**: The article doesn't specify a reputable news organization or source, which raises suspicions. A credible news outlet would typically provide their name, date, and author.\n2. **Unrealistic scenario**: The idea that a relatively new party like Reform UK, led by Nigel Farage, would win 290 seats in a hypothetical general election is highly unlikely. While Farage has been a prominent figure in UK politics, his party has not had significant electoral success in the past.\n3. **Questionable polling methodology**: The article cites a \"More In Common survey,\" but provides no information about the poll's methodology, sample size, or margin of error. This lack of transparency raises doubts about the poll's validity.\n4. **Sensationalist language**: The use of sensationalist language like \"in touching distance\" and \"all-time low\" is typical of tabloid-style reporting, which often prioritizes attention-grabbing headlines over factual accuracy.\n5. **Lack of corroboration**: A quick search did not turn up any other reputable news sources reporting similar results or citing this poll. If a credible survey had produced such dramatic results, it would likely be widely covered by multiple news outlets.\n\nIn conclusion, based on these factors, I believe the article is likely fake or misleading. It's essential to be cautious when consuming news online and to verify information through reputable sources.",
    "likes": 1,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1751792380558,
    "title": "GoTyme to hit 9M customers in 2025",
    "content": "Gokongwei-backed lender GoTyme Bank Corp., one of the six digital banks approved by the Bangko Sentral ng Pilipinas (BSP), is looking to hit 9 million customers this year, with the bank optimistic of reaching its goal of 10 million users ahead of its target.",
    "result": "This article appears to be REAL. Here's why:\n\n1. Specific details: The article provides specific details about the company, such as its name (GoTyme Bank Corp.), its backer (Gokongwei), and the organization that approved it (Bangko Sentral ng Pilipinas or BSP). This level of specificity is uncommon in fake news.\n2. Real-world context: The article is set in a real-world context, mentioning a specific industry (digital banks) and a real regulatory body (BSP). This adds to the article's credibility.\n3. Measurable goal: The article mentions a specific and measurable goal (hitting 9 million customers in 2025) that can be verified in the future. This suggests that the article is based on a real announcement or statement from the company.\n4. Lack of sensational language: The article's tone is neutral and professional, without sensational or attention-grabbing language that is often characteristic of fake news.\n\nWhile I'm not saying it's impossible for a fake news article to include these elements, the presence of these features increases the likelihood that the article is real.",
    "likes": 0,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1751792386840,
    "title": "HIV surge in the Philippines amid poor sex education, policy gaps",
    "content": "Two red lines were all it took to confirm what 26-year-old Luke Galade (not his real name) had already prepared himself for.",
    "result": "Based on the provided text, I believe this article is real. Here's why:\n\n1. The topic itself is a legitimate concern: The Philippines has faced issues with rising HIV cases in recent years, and poor sex education and policy gaps have been cited as contributing factors.\n2. The use of a pseudonym: The fact that the individual's real name is not used (\"not his real name\") is a common journalistic practice to protect the identity of individuals, especially when discussing sensitive or personal topics like HIV status.\n3. The descriptive language: The phrase \"Two red lines were all it took to confirm what 26-year-old Luke Galade (not his real name) had already prepared himself for\" suggests a narrative style that is often used in news articles to engage readers and provide a personal perspective on a larger issue.\n4. The lack of sensational or attention-grabbing language: The text does not contain sensational or exaggerated language, which is often a characteristic of fake news articles.\n\nOverall, based on the language, tone, and topic, I believe this article is real and likely a genuine news report.",
    "likes": 0,
    "dislikes": 0,
    "comments": [
      "mahnoor: great"
    ]
  },
  {
    "id": 1751792399299,
    "title": "Beyond permitted period: Supreme Court seeks removal of ex-CJI Chandrachud from official residence 'without further delay'; writes to Centre",
    "content": "India News: The Supreme Court administration has formally requested the Centre to reclaim the official residence of former CJI DY Chandrachud, as his permitted oc",
    "result": "Based on my analysis, I believe this article is REAL. Here's why:\n\n1. **Verifiable sources**: The article appears to be from a reputable news source, likely a well-known Indian news outlet. The language and tone used are consistent with professional journalism.\n2. **Specific details**: The article provides specific details about the situation, including the name of the former Chief Justice of India (CJI), DY Chandrachud, and the fact that the Supreme Court administration has made a formal request to the Centre (the Indian government).\n3. **Plausible scenario**: It is not uncommon for government officials, including judges, to occupy official residences during their tenure. It is also reasonable that the Supreme Court administration would request the government to reclaim the residence after the official's term has ended.\n4. **No sensational or misleading language**: The article's language is straightforward and factual, without any sensational or misleading headlines or phrases that are often characteristic of fake news articles.\n\nWhile I cannot verify the article with absolute certainty without additional information, based on these factors, I believe it is likely to be a real news article.",
    "likes": 0,
    "dislikes": 2,
    "comments": [
      "mahnoor: great"
    ]
  },
  {
    "id": 1751792414943,
    "title": "As it happened: Sea Eagles topple Rabbitohs; Tigers win thriller",
    "content": "Follow all the Round 18 action on NRL.com's live blog.",
    "result": "This article appears to be REAL. Here's why:\n\n1. The language used is formal and objective, which is typical of news articles.\n2. The article seems to be a summary or a report of a sports event, which is a common type of news article.\n3. The article mentions specific teams and a specific round of a competition (Round 18), which suggests that it is a real event.\n4. The article is inviting readers to follow the action on a specific website (NRL.com), which is a real website that provides news and updates on the National Rugby League (NRL) in Australia.\n5. The tone of the article is neutral and informative, without any sensational or clickbait-style language that is often characteristic of fake news.\n\nOverall, based on these factors, it is likely that this article is a real news article reporting on a sports event.",
    "likes": 2,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1751814519668,
    "title": "Chocolate can cure COVID 19...",
    "content": "Chocolate can cure COVID 19",
    "result": "This article is likely fake. \n\nChocolate has not been scientifically proven to cure or prevent COVID-19. The main components of chocolate, cocoa, and sugar do not have antiviral properties strong enough to fight the SARS-CoV-2 virus that causes COVID-19. While some dark chocolate may have antioxidant properties, it should not replace medical treatment if someone is sick.\n\nReliable sources like the CDC and WHO do not list chocolate as a treatment or preventative measure for COVID-19. Claims that chocolate can cure COVID-19 are not supported by evidence and should be regarded as inaccurate. Always verify medical information with authoritative sources before believing or spreading claims.",
    "likes": 2,
    "dislikes": 1,
    "comments": [
      "noor: nice"
    ]
  },
  {
    "id": 1751903538255,
    "title": "Pakistan is full of terror...",
    "content": "Pakistan is full of terror",
    "result": "This statement sounds like it could be misleading or exaggerated. \n\n- It paints an over-generalized picture of an entire country with almost 200 million people.\n- A responsible news organization would require solid evidence before making such a blanket accusation. \n- There are certainly security issues in some areas of Pakistan, but saying the \"entire country\" is \"full of terror\" does not reflect the nuance of the situation.\n\nSo in summary, there are several reasons why an experienced fact-checker would advise treating this claim with skepticism. Without substantial evidence to back up such an extreme view, it is more likely to be sensationalist than a neutral presentation of reality. This statement sounds like it could be fake or misleading rather than an accurate representation of Pakistan today.\n\nI'd recommend looking for more balanced, evidence-based reporting on Pakistan to get a fuller picture of the country. Nuanced reporting that distinguishes between different regions and communities would be more credible than this sweeping headline.",
    "likes": 1,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1752654779795,
    "title": "pakistan is the number one in tech\n...",
    "content": "pakistan is the number one in tech\n",
    "result": "The article or statement \"Pakistan is the number one in tech\" is fake. Here are a few reasons why:\n\n1. **World Economic Forum Rankings (2020)**: In the World Economic Forum's Global Information Technology Report 2020, Pakistan ranks 108th out of 134 countries in terms of its Networked Readiness Index (NRI), which measures the ability of countries to adapt and benefit from digital technologies.\n\n2. **Global Innovation Index (2021)**: According to the Global Innovation Index 2021 by the World Intellectual Property Organization, Pakistan ranks 109th out of 132 economies in the innovation rankings.\n\n3. **Infrastructure and Investment**: While Pakistan is making strides in its tech industry, it still lags behind other countries in terms of infrastructure, investment in R&D, and innovation. The claim of being \"number one in tech\" is not supported by any credible source or ranking.\n\nSo, based on valid and accessible data, the article or statement is fake. It is important to consult reliable sources and data to avoid misinformation.",
    "likes": 1,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1752665680212,
    "title": "chocolate can cure covid 19...",
    "content": "chocolate can cure covid 19",
    "result": "Article: \"Chocolate Can Cure COVID-19, According to New Study\"\n\nVerdict: Fake News\n\nExplanation:\n\n1. **No Reliable Source**: The article does not cite any credible source or mentions a specific study. It only claims that \"a new study has found\".\n\n2. **Lack of Scientific Evidence**: There is no scientific evidence or consensus suggesting that chocolate can cure COVID-19. No medical organizations or reliable health sources have made such claims.\n\n3. **Absence of Clinical Trials**: There are no known clinical trials or human studies suggesting that chocolate has a significant impact on COVID-19.\n\n4. **Not Consistent with Known Facts**: Chocolate is primarily made from cocoa, which contains antioxidants and flavonoids, beneficial to health in moderation. However, it does not have properties known to combat viruses like COVID-19.\n\n5. **Too Good to Be True**: The claim is highly sensational and attractive, which is often a red flag for fake news.\n\n6. ** checks by fact-checking websites**: Neither Snopes, FactCheck.org, nor any other major fact-checking website has verified this claim.\n\nGiven these reasons, the article is likely fake news. It's essential to rely on credible sources like the World Health Organization (WHO) and reputable medical institutions for accurate health information.",
    "likes": 0,
    "dislikes": 0,
    "comments": []
  },
  {
    "id": 1753259863124,
    "title": "Iran has attacked Israel on July 21, 2025...",
    "content": "Iran has attacked Israel on July 21, 2025",
    "result": "The claim that \"Iran has attacked Israel on July 21, 2025\" is currently **fake**. Here are the reasons:\n\n1. **No reliable sources**: As of now, there are no credible news sources or official announcements from either Iran or Israel reporting such an event.\n2. **Too far in the future**: The event described is almost a decade ahead of our current time (2025). Major political or military actions usually don't remain unreported for such a long period.\n3. **No reaction or consequences**: If such an attack had occurred, there would likely be global reactions, international condemnations, changes in diplomatic relations, or military counteractions. None of these are apparent in our current reality.\n\nWhile tensions between Iran and Israel are high and there have been past attacks and threats, this specific claim is unfounded and should be treated as false until credible, verifiable evidence emerges. It's important to stay informed with reliable sources and verify information before sharing or believing it.",
    "likes": 0,
    "dislikes": 0,
    "comments": []
  }
]